#+STARTUP: overview

** TYPESCRIPT

    #+BEGIN_SRC emacs-lisp
      (use-package typescript
        :ensure t)

      (use-package tide
        :ensure t)

      (defun setup-tide-mode ()
        (interactive)
        (tide-setup)
        (flycheck-mode +1)
        (setq flycheck-check-syntax-automatically '(save mode-enabled))
        (eldoc-mode +1)
        (tide-hl-identifier-mode +1))

      (setq company-tooltip-align-annotations t)

      (add-hook 'typescript-mode-hook #'setup-tide-mode)
      (add-hook 'web-mode-hook
                (lambda ()
                  (when (string-equal "tsx" (file-name-extension buffer-file-name))
                    (setup-tide-mode)
                    (setq emmet-expand-jsx-className? t))))
    #+END_SRC

    #+RESULTS:
    | (lambda nil (when (string-equal tsx (file-name-extension buffer-file-name)) (setup-tide-mode) (setq emmet-expand-jsx-className? t))) | (lambda nil (if (string-equal tsx (file-name-extension buffer-file-name)) (progn (setup-tide-mode)))) | er/add-web-mode-expansions | emmet-mode |


